app/controllers/admin_controller.rb

SELECT * FROM "lists" WHERE ("lists"."id" = '1') LIMIT 1
INSERT INTO "messages" ("message_state_id", "created_at", "body", "origin_id", "from", "updated_at", "to", "recipient_id", "origin", "type", "list_id", "sender_id") VALUES(NULL, '2011-05-19 19:47:35', 'type your message here oh thank god', NULL, 'Web', '2011-05-19 19:47:35', '1', NULL, NULL, 'WebMessage', 1, NULL)
SELECT * FROM "message_states" WHERE ("message_states"."name" = 'incoming') LIMIT 1
---
  def send_message
    @list = List.find(params[:list_id])
    @message = WebMessage.create(:to => params[:list_id], :from => 'Web', :body => params[:message_body], :list => @list)

    MessageState.find_by_name("incoming")