app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "all_users_can_send_messages", "created_at", "allow_email_gateway", "prefer_email", "text_admin_with_response", "updated_at", "long_name", "open_membership", "save_response_in_interface", "incoming_number", "custom_welcome_message", "allow_commercial_gateway", "email_admin_with_response", "moderated_membership", "use_welcome_message", "incoming_phone_number", "use_incoming_keyword") VALUES('TEST', 't', '2011-03-15 22:35:40', 't', 't', NULL, '2011-03-15 22:35:40', 'test o matic', 't', NULL, NULL, NULL, 't', NULL, NULL, 'f', NULL, NULL)
UPDATE "lists" SET "updated_at" = '2011-03-15 22:35:40', "all_users_can_send_messages" = 'f' WHERE "id" = 1
---
  def create
    @title = "Create List"
    @list = List.create(params[:list])
    if @list.save

SELECT * FROM "lists" WHERE ("lists"."name" = 'test') LIMIT 1
---
  def check_name_available
    return unless request.xhr?
    if params[:name] =~ /\s+/
      avail = "List name cannot contain spaces!"
    else
      avail = List.find_by_name(params[:name]) ? "Not Available." : "Available!"

SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."id" = 1)
---
  def toggle_admin
    return unless request.xhr?
    number = PhoneNumber.find(params[:list_member_id])