app/controllers/messages_controller.rb

  def index
    if @list
      @messages = @list.messages.for_display.page(params[:page]).per(20)
---
SELECT * FROM "messages" WHERE ("messages".list_id = 1) ORDER BY created_at DESC