app/controllers/twilio_sms_controller.rb

INSERT INTO "messages" ("modified", "created_at", "body", "origin_id", "from", "updated_at", "to", "origin", "created") VALUES(NULL, '2010-04-01 20:12:04', 'this is a sandbox test', 'sms_sid', '2679777848', '2010-04-01 20:12:04', '4155992671', 'twilio', NULL)
INSERT INTO "message_states" ("name", "created_at", "updated_at") VALUES('incoming', '2010-04-01 20:47:08', '2010-04-01 20:47:08')
SELECT * FROM "message_states" WHERE ("message_states"."name" = 'incoming') LIMIT 1
---
    def index
        body = params['Body']
        from = params['From']
        to = params['To']
        sms_sid = params['SmsSid']
        account_sid = params['AccountSid']

        message = Message.create(:from => from, :to => to, :body => body, :origin => 'twilio', :origin_id => 'sms_sid')
        incoming = MessageState.find_or_create_by_name("incoming")