app/controllers/users_controller.rb

INSERT INTO "phone_numbers" ("number", "created_at", "gateway_preference", "updated_at", "provider_email", "user_id", "last_name", "first_name") VALUES('2679777848', '2011-03-23 00:42:41', NULL, '2011-03-23 00:42:41', NULL, NULL, NULL, NULL)
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "perishable_token", "admin", "password_salt", "last_name", "persistence_token", "login", "first_name", "email") VALUES('2011-03-22 23:13:31', '3b3946523e9caea4a6dbbab198a0224ec0e3373e009ccc6ccffe42fe132fe330ba09aad3dcad6b1d10e356150ff4530191342a95252b978b6aeaa4ab3641ee56', '2011-03-22 23:13:31', 'av1d88SwqbYcujbNiUN', 'f', 'JxtD2X4MDrfTZRMNbN83', 'Marcus', '4663816f232400fe8d665b77d00647de65c0df8a5aa517bf162e3e375bdf707e16ee4499aa1a7ed722d332c4b243793e14f7d04b4a4b34246b4e7c99590afe7b', NULL, 'Josh', 'josh.marcus@gmail.com')
SELECT * FROM "phone_numbers" WHERE ("phone_numbers"."number" = '267-977-7848') LIMIT 1
---
  def create
    phone_number = PhoneNumber.find_or_create_by_number(:number => params[:user].delete('phone_number'))